example/Open/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 10 0 0 );

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform ( 0 0 0 );
        value           uniform ( 0 0 0 );
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            velocityABLWallFunction;
        print           0;
        U               U;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            slip;
    }
    back
    {
        type            slip;
    }
    CAARC
    {
        type            noSlip;
    }
}


// ************************************************************************* //
