example/Open/constant/DFSRTurbDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SRFGTurbDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setUp"
nThreads            16;                  //Number of threads per core usually one
nVtkSlices          20;                   //Number of section for visualizaion
recordSamples       off;                 //Record sample or not
sampleAll           off;                 //Record sample for all points or not
deltaT              0.0008;              //Time step for the simulation
fMax                625;                 //Maximum frequency
patchName           "inlet";             //Inlet patch name
endTime             10;                   //End time of the simulation.
nProc               $nCores;             //Number of processors
N                   256;                //Number of frequency steps
Ni                  20;                  //Number of points used for interpolation
q                   4;                   //Degree of polynomial for locating distribution of interpolation points
r                   2;                   //Degree of polynomial for locating distribution of interpolation points
seed                12515;               //Seed used to generate the random phase angles from uniform distribution.
C                   (
                      3.00 10.0 7.00 
                      3.00 6.50 5.50 
                      0.50 6.50 3.00 
                    );                   //Coherency decay coefficient matrix.
refPoint            (0.75 0.5 0.5);      //Reference point for inserting the plane
direction           (1 0 0);             //Direction to which the plane will be perpedicular
addMean             on;                  //Add mean velocity to the flactuation.
rhoUW               0.0;               //Netative correlation between the U and W component of the velocity.To get apropriate shear stress profile   
corrMassFlux        off;                 //If turned on corrects mass flow rate.    
timeSegments        10;
// ************************************************************************* //

